[
  "Black Mirror for sure\n\nThe first season of True Detective\n\nNetflix Dark (but switch to german language with English subtitles the dubbed isn’t as good)\n\nHannibal fulfills all of your criteria.\n\nAltered Carbon - the acting is good but not as good as West World, and it is definitely thought provoking and deals with questions about what it means to be human. The production value is pretty good as well.\n\nFrom the same creator I'd definitely recommend Person of Interest\n\nDefinitely Mr. Robot! It constantly blows my mind and makes me reconsider how I think the world works. Awesome depictions of modern tech, and similar to Westworld it's very mysterious in regards to what's actually happening in the bigger picture of the story (the story has even gone so deep as to include a shot of the Large Hadron Collider in the last season IIRC). Tons of crackpot theories on that sub just like this one.\nThe Fargo TV show also drew me in for similar reasons. It's much less serious and mindblowing but VERY well written/produced and engaging, feels like it belongs on HBO.\n\nThe Leftovers. True Detective. Travelers. The Expanse (for the sci-fi fix).\n\nLegion, Mr Robot.\n\nIf you haven't watched LOST yet, watch that.\nWatching Westworld season 1, reminded me of watching Lost back in the day. Theorizing and clue hunting back when there was no widespread internet use.\n\nCheck out Orphan Black!\n\nfrom hell, the book\n(don't bother with the film at all)\n\nTwin Peaks ticks all of the above requirements.In fact, I would love the Westworld sub Reddit to decipher it.That show is way toooo complex for a human brain to process\n\nLegion! Theories galore\n\nThe leftovers for sure (and I agree with the others that season one is the weakest but then it gets really good)\n\nMr.Robot hands down.\n\nLost\n\nThe Handmaid's Tale\n\nHonestly, Counterpart. fresh show you don't have a lot to catch up. It ticks all of your boxes and the foreshadowing is great if u catch it.\n\nHumans\n\nI have watched most of the episodes. But will continue ! Thanks.\n\nAlready watched it. Loved every bit of it ! \nI love spacetime so yeah, I'm in love with shows like Dark.\n\nThank you. Will give it a shot.\n\nOhhh, I second this one! Great rec!\n\nSleeves and hosts bring up so many of the same questions\n\nThanks !\n\nThe Expanse doesn't get half the love it deserves.\n\nI have started The Leftovers and watched True Detective I must say, season 1  of The Leftovers was difficult to get in but season 2 seems promising and way better so far. \nThanks for the other TV shows. Will give them a shot.\n\nfirst two are my all time favorites\nI guess I should watch the other two as well\n\nI’ve started season 2 of Legion and I have finished episode 3 and I have literally no idea what is going on at all\n\nMr Robot is amazing - a mind bender like Westworld.\n\nEh - not even\n\nThanks ! Watched it. Loved it.\n\nBy Allen Moore ?\n\nThanks. I actually started it but didn't finish the first season, not because it was boring, but Netflix took it off here in France. But will continue !\n\nDefinitely thought provoking but seems a bit slow to me. I am halfway in and don't know if it's worth continuing. It just depressed the hell out of me.\n\nThis is said way to much about a lot of things, but imo, the Altered Carbon the book does it better. So if you have time, I think reading that too would be good.\n\nI've started to watch The Leftovers from the 2nd season, skipped the 1st by mistake\nI couldn't understand a thing, was mad at the creators but still kept on watching\neventually I've watched all three seasons and rewatch them annually because I love it so much \nI think it's the best show due to it's psychologism and characted development\n\nSeason 1 is the weakest. It's the only season based on the book (which I think is fantastic). The show became much more it's own thing after it departed from the book. The showrunners made an incredible team and the last two seasons took me on a hell of an emotional journey. Really cut to my heart.\n\nTravelers is interesting. It has some weak moments but it also has some really neat concepts. I would place it halfway between a WB show and an HBO show.\n\nDid you watch season 1? You need to.\n\nYup, Alan Moore\nI highly recommend not reading any synopsis/spoilers and just diving right into it\n\nCool\n\nI'd recommend trying to push through. It has it's tedious parts but things do start to pick up & plots move forward.\n\nI definitely agree for the characters, they're really great characters and amazingly fleshed out.\n\nJust one thing : do we ever get a small hint as to what happened to the ones who disappeared ? I like the characters and all and will continue watching, but I'm dying to know what happened. I mean, you can't just make something happen and not explain, even if it's a little bit. I hate it when that happens.\n\nI think a rewatch is in order. The show is a visual and creative feast but I don’t feel any jeopardy\n\nOkay, thanks :)\n\nSort.....of?\n\nYou'll learn to let the mystery be. Or be driven mad!\n\nYes, not sort of... The series has a sefinitive ending.\n\nHaha, I take that as a no. Anyway, thanks. Will stick with the show. I like the fucked up characters.\n\nI can give you more of a hint if you want. Let's say there's still debate. I reckon it's worth watching.\n\nThat's better than no answer. And thanks, this is sufficient. I want to see what happens :)\n\nIt depends... are you looking for just general AI/who’s-in-what-body themes?  Almost Human, Altered Carbon, Black Mirror... If you are looking for AI movies, Ex Machina.\nIf you just mean the highly twisted mind-bending mystery-in-a-mystery genre, LOST almost invented that.  Highly recommended if you haven’t seen it, although it gets a bit caught up in its own complexity in later seasons.  If you’ve seen that and still hungry for more complex sci-fi theorizing, then I recommend Dark.  Those 2 shows are freakin amazing.\n\nMaybe Mr. Robot\n\nThe show Westworld most often reminds me of is Battlestar Galactica. The final season is pretty weird and way too out there, but the first three seasons of that show are pure dynamite.\nAnd Westworld's puzzle-like plot, grey characters, nonlinear storytelling and love of philosophical questions and pop culture references also reminds me of LOST.\n\nJust going to cover the broad spectrum here of any aspects that overlap but all quality shows:\n\nDark (My favorite alongside Westworld)\nMr. Robot\nThe Outsider\nBattlestar Galactica / Caprica\nDirk Gently's Holistic Detective Agency\nFarscape\nLegion\nOrigin (youtube Red show, very good though)\nThe Man in The High Castle\nPreacher\nWatchmen (Movie first then show)\nThe Terror\n11.22.63\nAmerican Gods\nSee\nTaboo\nThe Handmaids Tale\nTrue Detective (season 1)\nUtopia (cannot recommend this one enough)\nFringe\nLost\nX-Files\nAltered Carbon\nCastle Rock\nThe Expanse\nWayward Pines\nChildhood's End (mini-series)\nStranger Things\nThe Haunting of Hill House\nDoom Patrol\n\nYou'll see a little bit of this and a little bit of that in all these shows despite being many genres.\n\nThis may sound ridiculous, but I enjoyed The Good Place!\n\nDark. ( with subtitles, no dub)\n\nPerson of interest is another great nolan work, a bit more “jason bourne-y” action, spies, government corruption/coverup, its a really quality show\n\nSuccession!!! Not a sick-fi but great drama (and funny).\n\nWhy no one is saying person of interest\n\nWatch Tales from the Loop. It’s a mind bending show about technology that also has beautiful and poetic takes on so many aspects of life. It’s incredibly focused and never over explains its themes to you, but you feel the emotional impact incredibly deeply. It’s a beautiful show, honestly probably my favorite to come out this year!!\n\nBlack Mirror\nFringe\nX-Files (S1-S7)\nAltered Carbon (S1)\nLove, Death & Robots\n\nI recommend the movie Upgrade. It's a scifi action thriller from 2018. I think it's got a near 90% on rotten tomatoes\n\nThe Futureworld movie and the few episodes of the cancelled \"Beyond Westworld\" tv series if you can find them. And of course the original Westworld movie (it's good to great too) if you hadn't seen it yet.\n\nCarnival Row - A fantasy world\n\nThe leftovers, The travellers, The Good Place, Upload\n\nMr. Robot, The Expanse, Altered Carbon, Humans\n\nTravelers\n\nI am not sure if you are open to animes, but if you are i would recomend watching Attack on Titan and Steins; Gate since they have quite complex plots with alot of mysteries and plot twists. Attack on Titan dosen't seem like a mystery series at first, but for each season the plot becomes alot more complex and amazing.\n\n[deleted]\n\nDark is a must, season 3 coming soon too!\n\nThanks! I was referring to the latter. Have never seen LOST. Might take that out for a spin. But I do love Altered Carbon.\n\nGood list (though they vary in production quality).  I was wondering what you thought of the Watchmen series.  I am already a fan of the graphic novel, and to some degree, the movie adaptation (well, meh).\n\nThanks for the exhaustive list!\n\nDoesn’t sound ridiculous at all. I’m sure Ford would appreciate it too 😃\n\nYes, Succession is great! Some might argue that Cousin Greg is the best thing about it.\n\nWas wondering this, because Season 3 was POI repackaged.\n\nThanks, Attack on Titan was awesome (and that title track!). Will check out Steins.\n\nA rewatch is on the agenda for sure, but right now is too soon.\n\nThanks for the reminder to check... get hyped!\n\nYou are in for a treat, haha.  There will never be a unique cultural phenomenon like LOST again (although it was a lot more fun watching it broadcast in real time with thousands of other fans, all hunting for Easter Eggs together).  I kind of envy you for being able to watch from the beginning!\nDefinitely check out Dark, too.  Highly underrated German show on Netflix.\n\nI started with the graphic novel, loved it, then the movie I felt was a 90% hit but you can easily remember that 10% miss, the series picked up that 10% in my opinion and nailed it. Unfortunately, it's only going to be one season.\n\nIt's uncanny what WW and this little comedy show share in terms of structure. S1 with a big twist at the end. S2 with being up front with the multiple time lines. A more straight forward s3. Maybe WW s4 will have the protagonists take over the running of the world as they realise their utopia is not as glorious as they thought it would be. 😁\n\nNice. Steins Gate might seem abit slow in the begging, but just hold out until episode 12. From there on it is incredible.\n\nDark was fantastic. For myself I had to watch it in original German audio and read subtitles. The dubbed over English kills the acting performances\n\nI did watch some of it but didn’t stick it out till the end. Can’t seem to remember why now. 🤦🏻‍♀️\n\nNice.  I only hate watching with subtitles because focusing on the subtitles makes me miss Easter Eggs.\n\nThe last two seasons of Lost were a mess.  The writers got caught up in their own promise to the fans -- that they weren't making it up as they went along -- and abandoned what made it great in order to appear to fulfill that promise. \nBut I'm still very glad I watched it.  You might consider watching most of it spoiler-free but then allowing yourself to be spoiled before the very end.  Then you won't be as annoyed as the rest of us were.\n\nBut I'm still very glad I watched it.  You might consider watching most of it spoiler-free but then allowing yourself to be spoiled before the very end.  Then you won't be as annoyed as the rest of us were.\n\nSounds ominous :D\n\nOh man, the 4400!\n\nNever watched it but after reading the short premise, I'd suggest TV series Dollhouse. 👌 Kinda reminds me of it, the moment of \"using people\".\nAlso, you can catch YouTube's show Impulse. There are 2 seasons with the first one being free to stream. Guess that'll happen with the second one in a few months as well.\n\nLike mindfuck shows? Mr. Robot.\n\nDark.  Not similar to Westworld plot-wise, but a mind blower for sure.\n\nIt’s pretty old school and from the 60s, but The Prisoner is a crazy mind fuck\n\nAltered Carbon\n\nPerson of Interest was created by the same people.\n\nTravelers  \nNot robots but if you dig sci fi you will love it.\n\nNot a TV show but Ex Machina might be a pretty good watch for you\n\nIf you haven't seen the OA it is really good. Don't let the first episode fool you into thinking it's a normal show. The show has mystical mysterious sci-fi elements that evolve later and season 2 gets really interesting. Heads up though it seems to have been cancelled so the story will either be on pause or unresolved but don't let that stop you from trying it out. It is a bit like westworld experiments and there are different worlds in the same universe that the original characters don't know about. I haven't seen it mentioned here so I thought you should have my suggestion. :)\n\nIf you have Amazon Prime, I'd suggest Humans. I've only seen the first season, but it's pretty good.\n\nThis is probably a little obvious, but Lost if you never saw it back in the day.\n\nNot on netflix, but Dollhouse[1] is on Hulu.\n\nTravelers\n\nI don't think it's on Netflix but try humans\n\nAlias with Jennifer Garner. It was one of JJ Abrams first shows. Really great!\n\nThe Watchmen series on HBO has a similar tone.\n\nPenny Dreadful.\nIt's supernatural victorian gothic as opposed to sci-fi, but the production values and epic scope are quite on par with one another.\n\nThere’s a Russian show about robots that get autonomy. Just watched an episode today.\n\ni see people compare The OA to Westworld now and then. I haven't seen westworld, but can see some story comparisons. but beware it's easy to get hooked on the puzzle, especially the puzzle in Season 2.\n\nNot Netflix, but Yellowstone on Prime has many similarities\n\nNot Netflix but youll probably like his dark materials on hbo. Just started last week.\n\nLost\n\nI assume you mean Season 1\nAgree with Altered Carbon - and it’s a good book as well\nTry “Black Zone,” sort of a French Twin Peaks. \nAlso try “Dark”\n\nGodless - limited series, Netflix I believe.\n\nBlack Mirror. It is not like Westworld, but I think you will like it. I watch those episodes over and over again. Mind blowing.\n\nNeon Genesis Evangelion. It is a Japanese anime from the 90s and one of the most highly regarded shows of all time (animation or not). And boy, is it a mindfuck.\nDon't be offput by the generic \"fighting mecha\" look of the show. It is incredibly deep, confusing, psychological and metaphorical. And there are plenty of interesting parallels to Westworld: an enigmatic father figure running everything, an organization running things with uncertain motives and main characters trying to figure out (and being pushed around by) the system.\n\nMr. Robot\n\nLove, death, robots.\n\nIdfk know wtf is going on with the last season tho\n\nThe Leftovers. You'll spend multiple seasons wondering wtf is happening just like in WestWorld\n\nHaving read his dark materials.  It may not seem it but keep watching.\n\nYou’re talking about just the first season... right?\n\nthe sinner, handmaid's tale\n\nKinda sorta the new Watchmen series also on HBO.\nHas that same element of spending 75% of the episode trying to puzzle together wtf is going on.\n\nThat's hard-especially for Netflix.  I feel like Westworld is it's own beast.\nMaybe Mother?\n\nIf you like the Western aspect and don’t mind the lack of A.I, future tech, etc. I recommend Bone Tomahawk on prime\n\nSpoilers in this comment!\n​\nWestworld Season one was almost perfect television.   Episode nine was one of the highlights of my TV watching life - sadly it all went wrong after that episode.\n​\nEpisode ten should've seen the \"robots\" escaping into the real world - unfortunately we had to endure an entire further season set inside the park.   But they just wanted to milk the cash cow I suppose...\n\nYou mean shows that make no sense, but you keep watching bc of the big budget, and the hope that it’ll get better and suddenly all come together?\nSorry, no suggestions.\n\nMasquerading like a \"deep\" show that is actually just ridiculous, poorly written, and overhyped?\n\nHBO owns the rights. Never gonna happen.\n\nSuch an underappreciated show.\n\nShame it was not given a decent ending\n\nThanks! They both look really interesting and I've never heard of them either.\n\nAgree. Similar element of \"puzzle tv\".\n\nI keep hearing about this one.  I need to check it out.\n\nPardon my English but Dark is fucking awesome.\nIt literally ruined tv for me. I can't find anything else as good.\n\nYou didn’t find it too depressing? I started it but only partway through the first episode ... was thinking it would be sad/make me feel low. But maybe I’m wrong ...\n\nI read Op title and thought to post Dark as a meta joke about how this sub answers Dark to every unrelated request.\nBut you were faster! Except, not ironically! :P\n\nReally really great show but if you're going for it, please watch it subtitled - the dub is straight awful.\n\nIt's all the confusion of Westworld, but in a different language and you have to remember at least three different actors playing each character.\n\nThis. Right here. Don't sleep on The Prisoner. Only one brilliant season.\n\nI've seen this and I know it got some pretty negative reviews, but I really enjoyed it. Hope there's a season 2 in the works.\n\nAbsolutely loved the books and show. Why the hell wasn't it given more PR and seasons?\n\nPerson of Interest starts off pretty banal, but around halfway through season 2 it transforms into a completely different show. It's one of the biggest turn-arounds I've ever seen.\n\nI don’t trust cbs unless it’s Star Trek or the twilight zone\n\nI loved Travelers.\n\nThis show is so, so good.\n\nIt's a rare thing: a Netflix show that concludes the story before being cancelled.\n\nTravelers is garbage.\n\nNever heard of this but I watched a trailer and it looks like a ripoff of Odyssey 5.\n\nI love the OA, and am so disappointed it got canceled. There's some great talent in that show, and the worldbuilding is super interesting.\n\n[deleted]\n\nThere's also the original, Akta Manniskor (usually translated \"Real Humans\" but I prefer \"Real People.\")\n\n2nd season is good, too.\n\nTo piggyback on this also Fringe. Great Sci Fi show with interesting characters and it’s a wild ride.\n\nNot on Netflix US\n\nList jumped the shark at some point though. Was great for a few seasons.\n\nAlso not on Netflix, but Battlestar Galactica definitely fits the bill.\n\nIs it really that good, I gave up after a couple of episodes...\n\nSeconded.\n\nI've watched it and really enjoyed it.\n\nIts honestly an underwhelming show that never really takes off in my opinion. Eva Green is amazing in it, though.\n\nLOVED the first two seasons of this and season three was.... yeah I pretend there wasn't an S3\n\nThis is a good one! Better Than Us on Netflix.\n\nYou keep posting that \"The OA\" is \"the best thing ever\" when never applicable to a suggested movie or TV series. It's hot PC garbage and nothing like Westworld.\n\nKevin Costner?  Doesn’t look like it on Prime in the USA\n\nI didn't realise this had already started, thanks for the heads-up. I've been looking forward to this!\n\nAlso, fringe but that’s more episodic\n\nYeah season 1 is still one of my favourite shows ever. I think I like it more than GoT.\nI know everyone is crazy about 'Dark' but I just couldn't get into it and lost interest. I might give it another try one day.\nLoved Altered Carbon, and I'll give 'Black Zone' a look, thanks.\n\nSaw this and loved it. It was a really good series.\n\nI loved this show. The cast and the acting was amazing!\n\nSeason 1 blew my mind, but season 2 was still great and included Kiksuya, which is up there with my favorite episodes of anything, ever.\n\nSo nice of you to take the time to comment and tell me you have nothing to offer to this thread. Thanks for the insight.\nI actually liked the premise of Westworld, particularly in season 1. And I thought a lot of the acting was outstanding. I don't really care about the budget and there are a lot of shows with a small budget I've enjoyed too. I just wanted suggestions, which is why this sub exists.\n\nWell don't watch it then. And why bother involving yourself with a post about a show you hate anyway?\nYou understand that personal taste is subjective right? Ya try-hard edgelord.\n\nWhat's never gonna happen?\n\nI wonder if it’s better because of the mystery\n\nIf we're going off Netflix, 12 Monkeys is an incredible post-apocalyptic show. But yeah. definitely Dollhouse.\n\nDollhouse is fantastic fyi. It’s occasionally kinda campy, and some of the futuristic stuff hasn’t aged well in the decade-plus since they filmed it. But it’s super fun, an interesting premise, and well acted for the most part. Some of the guest stars include Patton Oswalt and Alan Tudyk among others. If you like other Joss Whedon products, you’ll probably enjoy it.\n\nTop three favorite show for me ever. Last season (season three) comes out next year\n\nVery very good\n\nWatch it in German with subtitles, the English dub messes with all the sound effects and the actor sound goofy.\n\nIt is good, and I’m sure you’ve also heard not to watch the dubbed version, but don’t do that. Subs or nothing.\n\nBest show I’ve ever seen.\n\nI recommend watching it in the native German with English subtitles.\n\nIt turns people off because it's in German so you have to read subtitles and the English dubbing takes away from the quality of the show IMO.\n\nIt is good. Keep at it.\n\nIch bin du!\n\nYou need to keep watching. Everyone is a miserable jerk for good, interesting reasons!\n\nThere's definitely tragic elements but you should stick with it.  It's amazing television.\n\nits crazy depressing \nI watched the whole first season and its just relentlessly dreary from an emotional standpoint. \nI watched the frist ep of S2 and it just stays the same way, everyone is grief stricken and morose and mopey. I can't handle it. \nI mean its a good show, don't get me wrong. But holy shit, EVERY scene is more dreary than the last.\n\nAgree. I watched first ep and find that's it's really sad.\n\nYou say that as if it's a bad thing.\n\nThere will be a season 2 but due to the nature of the story there will be a different actor (Anthony Mackie) playing the main character. As far as I know though there isn't a release date.\n\nI feel like Altered Carbon started off incredibly strong and then loses a lot of steam along the way. I also go with what others say that Westworld seems to degrade after Season 1 was finished. Still enjoy both shows but getting another season for either one seems daunting to me.\n\nReally negative reviews? I loved altered carbon.\n\nYeah, I can't even put my finger on why, but I didn't care for it.  I think it just felt like style over substance too much or something.  So much of it seemed contrived or super-tropey, that I kept rolling my eyes the way I do when watching a cheesy horror movie.\nIt's honestly the only high profile scifi show that has disappointed me.\n\nSeason 2 coming soon, in terms of PR, Netflix doesn’t do the best job IMO.\n\nI'm still struggling to get to that point. I hope it pays off because I'm kinda bored with case of the week. I like the people on it, so I'm looking forward to when it turns.\n\nman in the high Castle\n\nSince you mention this, I should also point out another series inspired by author Phillip K. Dick, Electric Dreams, which is also on Amazon Prime.\n\nFringe is great. There’s also a great Twin Peaks call out in one episode - which is another awesome show (although very much not like Westworld).\n\nCan't believe I've never heard of this because it looks like it's right up my street. Thanks!\n\nFauxlivia is 10x hotter than Olivia. Change my mind.\n\nOn Hulu\n\nAgreed but it’s still an absolute must-watch if you never did.\n\nKeep going, it gets better.\n\nIt definitely seemed like the writers were making it up as they went along, and really had a horrible finale when they realized it was being cancelled and turned it into Power Rangers for that last episode.\nFirst and second season were very cool IMO though.\n\nummmm...what dimension are u from? the 2 shows are often compared (ex. 1, 2 & 3) together. \ngo home troll.\n\nIt's on paramount network, whatever that is. It's really good though.\n\nWatchmen is stellar as well, if by some chance you dont stumble onto it.\n\nIt becomes less episodic in the later seasons. It’s sort of like the X Files, in that the early seasons are sort of “monster of the week” self contained stories, but the later seasons have a clear narrative arc.\n\nIts black spot, and yeah its really good.\n\nJustified?\n\nOr Tin Star. Amazon. Watch out, though, that first episode’s a doozy.\n\nCast and acting was great. Story made zero sense\n\nDark on Netflix should confuse you then. You’re welcome for the insight. Love you! ❤️\n\nWestworld on Netflix. Perhaps a similar show, but HBO don't share.\n\nNo\n\nIf you're a fan of the original movies, the 12 Monkeys series is a real let down.\n\nI still have to watch the new season but it’s been so long since I watched the first season I’m not sure I remember the exact timeline of events and haven’t brought myself rewatch it when there’s so much other new stuff to watch\n\nTop three favorite show for me ever. Last season (season three) comes out next year\n\nWhat are your other 2?\n\nI did not!  Thanks for the advice.\n\nWhere?\n\nYeah, I don't mind subtitles, especially when it helps me learn German.\n\nWell it's good to know it's in the works and he's a good actor too so I'm pretty optimistic about it.\n\nI like Anthony but I really like the first guy more\n\nNew main character or something? Hadn't heard of this.\n\nI agree that season 2 of Westworld didn't have the wow factor season 1 did, but I'm hoping that they make up for it with season 3. I loved season 1 so much that I can overlook how convoluted season 2 was.\nI actually liked the whole season of Altered Carbon. I didn't think it was particularly the deepest thing I've seen, but it was enjoyable for me.\n\nIt was great except for where they went away from the book in the second half. Not that I think books are sacred, it just wasn’t a good choice for where they went.\n\nIt pretty much always stays case of the week, they just add in the overarching plot that ties in periodically (ex. their \"case\" will help them fight one of the other factions or something like that). But honestly the production quality and writing quality just skyrocket, it's mostly the same thing but 10x better.\n\nLove it. It’s similar to Netflix’s ...ugh I can’t think of the show’s name\n\nThis looks pretty good, I'm going to have to check this out...\n\nFringe is one of my all time favorites, ever.  It does start a bit slow but man once it really gets into its stride, it’s fantastic.  John Noble should have won all the awards for his acting.  I won’t say anything else about the show except go in as blind as possible and stick with it.  I wish I could wipe it from memory and start all over lol.\n\nNo problem. The first season and part of the second season starts out episodic like the x-files but once characters are established the bigger story starts showing. Great show and a rewatch always brings something you missed before...same with westworld\n\nI know. Just tired of any non Netflix suggestions without at least saying what platform it’s on. Defeats the whole point of this sub\n\nNot going anywhere.\nJust b/c 'some people' think the OA is \"one of the best series ever made\"(that's retarded) doesn't make it anything like \"Westworld\".\nMultiple dimension travel ideas have been around for decades. What Westworld does on such a scale is unlike anything.\nInterpretive Lesbian Dance Theory to get to another dimension? HA HA HA HA. Just another agenda trying to be pushed along with the asian 'trans kid'.\n\nLOST has a \"flashback\" mechanic that focuses each episode around a particular character's backstory. Which means the first season is about meeting our characters and deepening our relationship with them. There IS also a forward-moving story line, but that's not the big focus of the first season.\n\nWhy would it confuse me? Do you always act smug and superior because people have different tastes in TV shows?\nCommenting on threads about things you have absolutely no interest in just seems like a waste of time and energy. But hey, whatever floats your boat.\n\nOh I know Westworld isn't on Netflix. I just wondered if anyone knew any similar shows, which are on Netflix.\n\nThey do like a five minute recap but I watched it a year after watching the first season and I definitely forgot things and connections even though about halfway through I remembered the gist of things. When third season drops I will definitely rewatch the first two seasons again first\n\nYou definitely need to rewatch the first season. I too thought that the recap could be enough, but it isn't.\nThe second time you get definitely more info, and can enjoy better the second season\n\nI’d say it’s probably Lost, True Detective (season 1), and Dark\n\nEh, I watched it dubbed and it was still excellent\n\nNetflix. It's under audio options.\n\nHis name is Joel Kinnaman. He’s currently in Hannah on Amazon and I highly recommend The Killing series on Netflix.\n\nNope, same main character. People change bodies, that’s the whole idea.\n\nProbably Black Mirror\n\nJust what I need. Really wanted a show that's totally immersive in the way Westworld was when I watched it.\n\nFirst, you obviously didn't see season 2 because you are talking like that was a main part of the story and you obviously missed the other Westworld tie ins.  So you don't like the dance. I don't care. But what kind of snowflake gets this offended by 5 people doing the Macarena? Especially, when it opens other dimensions and incorporates robots....\nSecond, Buck's character ends up being part of the puzzle in season 2 in a way that no other character could. But you seem to be extremely sensitive to things you don't understand like an IRL trans person playing a trans character.  I don't care that you don't like it bc The Mandalorian loves it! :)\n\nThe constant is one of best episodes of television ever made\n\nNothing too similar. Altered Carbon is very good, and I enjoyed Daybreak\n\nWe rebinged S1. No regrets.\n\nTrue Detective and Dark? You have good taste my friend.\n\nWait, someone managed to enjoy Lost to the end? How\n\nWhat language is it?  I like to habsorb things when possible.\n\nThat’s it!\n\nI initially skipped that show (when it was on the air) because of that episodic nature with a new case every time but a friend made me go back to it after one of the first twists happened, it's definitely worth sticking to and like Westworld I've had to go back and see if there were clues when some big twists happened\n\nASSumptions are not based in fact and get you nowhere.\nSnowflakes vote for Democrats and latch onto 'artsy and interpretive' stuff like this as if it's some world-changing thing. It isn't. They also defend it against anything negative or anything that doesn't share their views at all. Highly delusional.\n\nVery excited to do one and two when the final season is right around the corner\n\nhashtag same\n\nThank you!\n\nI mean, the last two seasons had their moments where the quality definitely dipped and some things were just not satisfying (like that temple place they were going to) but I still enjoyed the whole journey. I felt like all the important answers were provided (and honestly like 90% of them) and I enjoyed the finale immensely\n\nIt's a german Netflix original\n\nYou can't be serious. you really believe stuff like that? That there are people that fit into these made up designations. Now who's making assumptions not based on facts?\n\n100%\n\nI started watching it when it first came out and the first season was absolutely absurdly amazing. Still consider it one of the best first seasons of any series ever.    \nThe second season was good but starting season 3 I had trouble keeping up so I quit. Shit just got too confusing for weekly episodes. I binged it again in 2012 I think and finished it. Felt like opening 3 seasons were good/great and the final season was also good. But season 4 and 5 had lots of irrelevant stuff in hindsight.   \nAlso read later that a Lost writer admitted in like 2015 that there wasn't really a coherent plan to explain everything. A lot of times they made shit up not knowing how to solve it in the future just because they thought it would be a cool mystery. Very disappointing\n\nNice.  I enjoyed the WW2 German series Generation War so subtitles ain't no thing.\n\nStereotypes exist b/c they are based in facts.\nRacial profiling is also a great thing and it too is based on facts.\nPeople with common sense and intelligence know there are only 2 sexes with 2 corresponding genders. Sex cannot be changed. No amount of cutting things off, stuffing things in, paperwork, and wishing really hard is going to change it.\nFor the most part, I don't care what goes on in their brain about this. It clearly shows that something is wrong with them and they need HELP not encouragement.\n\nHad Generation War in my list for a while now. Did you like it?\n\nOh, I had assumed I was conversing with an adult. Good luck kid.\n\nI really enjoyed it but I love watching history channel and Hitler documentaries and that kind of thing.\nHaving said that, there is also good character development with romantic elements but in typically tragic conditions.\nBasically it starts out with a group of German young adult close friends (one of them being Jewish) and then you see how their lives go in different directions after the war breaks out.  It's not overwhelmingly sad.\n\nASSumptions are not based in fact. There are intelligent kids and adults; just like there are stupid children and stupid adults.\nYour opinion of me is subjective and not fact. Nice try.\n\nThe Leftovers is a fantastic show on HBO. I highly recommend.\n\nWestworld is based of a movie, have you watched that? Also there's deadwood which is a western that just got a movie. Others suggestions: \nCastle rock \nTrue detective season 1 and 3 (we don't talk about 2)\nThe expanse\n\nManiac has a similar vibe but totally different show. Black mirror maybe.\n\nEx Machina is probably as close as it gets to touching on all the major themes of Westworld without being Westworld.\n\nDark on Netflix\nMr Robot\n\nJonathan Nolan did another AI-themed show prior to this called Person of Interest (though it didn't deep-dive into the subject until the second season), which went on for five seasons.\n\nEl Machina (on Amazon Prime)\n\nAutomata.\n\nA number of Black Mirror episodes (Netflix) touch on AI and consciousness, as do episodes of PKD's Electric Dreams (Amazon).\nI would also suggest Altered Carbon, also on Netflix.\n\nCloud Atlas\n\nNot a show or a movie but I suggest Fallout 4. It deals with some of the questions brought in Westworld. Like are the Synths (hosts) can be considered or if they deserve freedom or genocide or to be slaves for Mankind. And will make you question if you are actually one of them. Plus it's a really good game and can't recommend it enough.\n\n'Legion' aired on FOX\n\nHonestly, I'd love more like Westworld and the way they have been pulling in the fans. It's no longer just a show for me, it's a brain exercise too. I love it, I love the puzzle bits they give online (even if I'm not smart enough to solve them), I love rewatching and getting new view points. Its really great in this way. They took the original movie, which I thought was such an amazing concept, and really fleshed it out. I don't actually like westerns, but this is so much more. I haven't found anything like this.\n\nThe OA on Netflix is incredible. It has more of a spiritual/mystical approach, but it is solid throughout the 2 seasons.\n\nNot necessarily the same, but I’d recommend The Expanse, The 100, and The OA for starters\n\nThe Sisters Brothers is a good western, Electric Dreams and Black Mirror are good sci fi anthologies. I Am Mother is a sci-fi involving robots, so is Blade Runner. Another western type is Hateful Eight. The show Humans is about robots that pass as humans.\n\n~~Based on a book~~\nI was wrong, it was a screenplay by Michael chrichton but not based on a book\n\nAfter a long day of Turing tests, you gotta unwind\n\nand it’s fantastic!\n\nDark 100%. Also, you’d get the added benefit of not having to wait to long for season 2 cause it’s gonna drop this month.\n\nHow is this like Westworld at all? It’s a good show but it’s not about androids, it’s not a western, it doesn’t have a similar plot. Mr Robot is not very similar either, though I guess if you stretch it is kind of similar themes as far as the maze, and human consciousness, unreliable narrator. Again it’s a good show though.\n\nAlso on Netflix\n\nLooked this up and surprised that I've never come across this webseries before. Cool premise.\n\nlove this one. It is a mind exercise like Westworld\n\nYes, yes, yes. The OA is amazing\n\nI watched Black Mirror, Mr. Robot and season one of Westworld around the same time back when it came out - I didn't trust anything or one around me for over a month...\n\nHow did you like that cliffhanger?\n\nOh god, I don’t even know what part three is going to be like. Brit and Zal are amazing. I really like that both of the shows are giant puzzles for the viewers to solve. It takes a special dedication to tiny details that most shows don’t have\n\nRewatching i think is just as satisfying as seeing it for the first time because you see their immense creativity. I cant wait to see what's in store for season 3. I hope it comes out soon 🤞\n\nBattlestar Galactica\n\nTo mention a few suggestions: The Expanse, The Man in the High Castle, Dexter, Person of Interest, Heroes, Sense8, Travelers.\n\nMr Robot. It's a great show in general, it has a very good plot, writing, characters, cinematography, as well as a very good ARG, with fans every week theorising and analysing.\nr/MrRobot\n*Edit: adding to this, it follows the format of the unreliable narrator, which I think is great if done well, which it is\n\nYou could also try Legion, it's based on an X-Men comic character but it's nothing like other superhero shows. It has great visuals and symbolism, and if you like not knowing just what is going on in your TV shows, you'll love this.\n\nFringe.\n\nI would recommend Twin Peaks, it is my favorite TV show with Westworld and Lost. The plot is complex (and also confusing at times!), the 26 years gap between 2 and 3 makes it extremely interesting for character development. But I know Twin Peaks is not everyone's cup of tea, one of this things you instantly like or not. Season 3 was one of the most beautiful content I have seen on tv, after a year I still spend a lot of time thinking about theories (and going over the extremely complex theories fans are developing). It is worth giving a try.\n\nI’m addicted to West world and just started watching Black Mirror!  If you haven’t yet!  Watch it watch it watch it!!!!  Uss callister!   And San Junipero!  Sooooooo gooood!\nI begeth you to go watch them now! \nOh ya and after you have watched those two episodes...... come back and talk about it!\nI want to know what you think!\nafter watching  Westwood Black mirror is what I needed.\n\nGame of Thrones, Sopranos, Alias, Dexter (first 4 seasons), Person of Interest, Stranger Things\n\nHandmaid’s Tale\n\nCastle Rock!\n\nI second Mr. Robot. One of my favorites. I also recommend Dark on Netflix. After binging you will want to rewatch almost immediately.\n\nThe closest thing to Lost is The Leftovers. It’s my favorite TV series of all time. It’s definitely not for everyone, but if you liked Lost there’s a good chance you’ll like The Leftovers. \nAlso, it’s created by the showrunner/writer of Lost.\n\nTrue Detective season one\n\nThe Leftovers is vary symbolic and will definitely keep you guessing between episodes\n\nPerson of interest. In many ways it’s the sister series to Westworld (same creator, same show runners, same writers, similar themes explored). All five seasons are on Netflix right now. I highly recommend it\n\n\"The Good Place\"  has the artificial-neighborhood-with-a-mystery setup like Westworld.   Also characters that develop during the story, and a lot of philosophizing over the situation.   Some mixing up of the timelines but they don't use it to confuse viewers as Westworld does.\n\nPerson of interest\n\nI just finished watching Person of Interest. Brilliant stuff. A slow start but once it gets into its stride it is unstoppable. There are several pointers in the show that shout out \"this is a jonathan Nolan show!\". An AI on the glitch asking \"Is this now?\" and being unable to determine if it is living a memory or not. The notion that some humans are bad code. And several times in the series the idea that as long as someone remembers you, you never truly die is presented. Plus some great use of music, Radiohead particularly and the Ramin Djawadi score is great.\nThe only thing I would warn you about this show is that the first season is very much a procedural case-of-the-week. And the procedural elements never truly go away for the entire 5 seasons. But the serial elements start to appear towards the end of S1 and then evolve into a web of cyber-punk, AI badassery gradually throughout the rest of the seasons. But at 23 episodes a season, it might feel like a long slog before it really grips you. \nIf I was to describe it in one sentence, i would say it is a cross between Christopher Nolan's batman (without the bat suit and fancy bat things), Westworld, the A-Team and War Games.\n\nBlack Mirror, Dirk Gently’s Holistic Detective Agency, Orphan Black!\n\nThe OC\n\nOrphan Black\nMindhunter\nTrue Detective Season 1\n\nAttack on Titan.\n\nI really enjoyed The 100, but the beginning of the first season was pretty cheesy. I’m glad I stuck through, though, it’s still a captivating show 5 seasons in.\n\nWell my top 5 series are Braking Bad, Better Call Saul, Sharp Objects, Billions and the above mentioned Westworld. Not all of them are like WW but they all are well written, directed and have a great cast. \nI also like Fringe and Person of Interest but sometimes I felt there were to many filler episodes and I kinda lost \"interest\" in watching them.",
  "A bit late to the party, but season one of Wayward Pines is worth a watch. Season 2 was a good enough continuation of the story, but S1 has a great Westworld-WFT-style mystery going on for the front half of it, then the second half reveals everything, and gets on with wrapping everything up in a tight little package.\n\nNobody mentioned \"Humans\" yet?\nhttps://www.imdb.com/title/tt4122068/\nBased on this:\nhttps://www.imdb.com/title/tt2180271/\n\nMaybe try Person Of Interest but it's not really like those but it was made by Nolan.\n\nDollhouse is a show that’s very similar to west world, made by joss whedon. I highly recommend it.\n\nThese are two of my favorite shows as well, so I can assume we have some similar tastes! Shows I usually recommend to people, although might not be comparable to Westworld and Lost but are great, captivating shows: Breaking Bad, The Night Of (HBO), Shameless (More of a comedy but a great show), Succession (new-ish on HBO, al you need to know if Kieran Culkin stars), Fargo (1st season), and Homeland\n\nThere are no other shows like Westworld or Lost.\n\nBlack Mirror is very thought provoking and some episodes have similar themes to westworld, lost etc. Every episode is pretty much standalone with different characters though.\n\nThe Wire. It’s a bit older now, but the story still holds. I think it’s the greatest TV show ever written. It’s genius is that it was always written as 5 sessions, so it has a proper story ark from beginning to end.\n\nThe Leftovers (my favourite TV series of all time): an excellent study on human nature, especially grief, loss and coping with those emotions. Brilliant writing, excellent acting (with some outstanding performances by almost every cast member) and directing.  \nBattlestar Galactica: it dealt with similar issues as WW, but it went much deeper and asked many more questions about what it means to be human.\n\nTwin Peaks. You're welcome\n\nCounterpart\n\nI cannot overstate the amazingness of FRINGE\n\nJust came in to mention 12 Monkeys, which was far better than it had any need to be.\n\nHere's my list:\n\n\nMr. Robot\n\n\nDark (netflix) Turn on subtitles with German audio, trust me.\n\n\nTrue Detective.\n\n\nMan in the high castle.\n\n\nLegion.\n\n\nDirk Gently's holistic detective agency.\n\n\nAmerican Gods.\n\n\nUtopia.\n\n\nPreacher.\n\n\nTaboo.\n\n\nThe Terror.\n\n\n11.22.63\n\n\nWhile these aren't all like Westworld, they are all high quality and I think you would appreciate them.\n\nPost TV Series depression is real! I watched S1 and S2 in about 20 days. One episode per night. \nNow I feel so lost. This thread will help me find my way, thanks\n\nI understand what you mean. It is not just about the excellence of the show (Sopranos, The Wire, Billions, Succession, Sharp Objects) but about the \"insanity\" on the plot. Thats why I came here, looking for the same you are. Too bad I already saw all seasons of Fringe  and The Leftovers. I would say The OA, Dark (from German on Netflix) and maybe Castle Rock could do that. I love the old Twin Peaks, not the new one. I will try American Gods, Legion, The Expanse and Dollhouse. Hope to find what we are looking for.\n\nWithout a doubt altered carbon, defiantly worth a watch.\n\nLegion,  Twin Peaks\n\n\"Legion\" was really excellent, though for me it is too different from Westworld to be comparable. I would say that where Legion is a creative graphic novel, Westworld is a more in-depth, literary series.\nOther than the truly life-changing Twin Peaks, (which others on this thread have already addressed), the show that most reminds me of Westworld is the original 1967 British TV series, \"The Prisoner.\" \nIn its 17 episodes there are several mind-blowing, highly-subversive subplots. But instead of \"cowboys & indians,\" it's \"spies & national security\" as the major theme. Replace Westworld's constant variations on the theme of \"consciousness\" with The Prisoner's ongoing exploration of \"free will,\" and there is a great deal in common. Both series feature slowly unfolding puzzles with surreal, humorous and horrific notes. Though there are significant differences, both series have numerous characters who are basically imprisoned in hi-tech theme parks, struggling with mind-wiping and programming. \nGeek culture has spent only half as much time on Westworld as on The Prisoner, which has been called \"the most over-analyzed TV series in the world.\"\nThe Prisoner was made in the 1960s and its mod fashion style and dramatic music reflects that time period, but in so many ways it is much more unique than that. Check it out (but avoid the horrible 2009 reboot)\nhttps://en.wikipedia.org/wiki/The_Prisoner\n\nI'm late to this party, but was googling shows like westworld and castle rock.  You should watch Castle Rock.  It is not like westorld in any way except: you've no clue what the fuck is happening but you trust it's all going to work out.  It all makes sense as it happens, but just confuses you more.  \nHigh quality show.\n\nHumans is a must watch if you liked Westworld.\n\nWatch The 4400!\n\nSense8 hands down.\nImagine if a group of humans had a \"hive mjnd\" and what the repercussions would be--That's Sense8. Amazing cast of characters. Full of diversity. Touching storylines. Beautiful cinematography. I've never seen a show like it. It's truly one of a kind. Definitely in my top 5.\nThe only negative is the set up of the show takes 3-5 episodes to really start connecting the dots and understand what the eff is going on. Lol, but once you get past those episodes, you'll be so happy you stuck it out.\n\n[deleted]\n\nI second\n\n[deleted]\n\nI love Travelers. I know that it's not perfect, but between the characters, the story arcs, and the sci-fi elements I find it really enjoyable.\n\nPerson of Interest, in particular, is what several people worked on after they worked on Lost and/or before they worked on Westworld; definitely a good recommendation for somebody who likes both of those.\n\nExcept don't watch past season 4 of Dexter. Trust me, just don't.\n\nI believe Alt Shift X will be doing videos about The Expanse soon, so I already had that one on my list. Guess this is one more reason to check it out. Thx!\n\nI'm sorry, but i currently feel like a critic.  Mean no ill will\nMr. Robot: Watched all of season one, not terrible, but the main plot was not very earnest (in a way), also felt exaggerated and heavy handed.  Not much (if any) like Westworld, but maybe season 2 would have a quality plot (seriously doubt it).  Nothing very thought provoking that i could remember.  Maybe Lost like quality, but not WW quality.\nThe expanse:  It is sci-fi.  That is all.  No notable similarities.\nDexter:  I enjoyed it, but i don't see any similarities.\nHeroes:  Was pretty enjoyable even with anxiety heavy plots (lost like, not WW).  Some similarities of outcasts and powers with WW.  Ended left much to be desired and the squeal left more.  Not thought provoking.\nSense8:  A bit of a clunky/anxious and slow plot.  Some good quality point, some bad.  Personally very different feel from WW.  Enjoyed season 1 a lot, not really much else.\nTravelers:  I like it.  It had a smoother (most of the time) plot with less 'macro' anxiety than anything above (WW like).  Some serious (temporary) quality drops and slower.  Can be thought provoking (Note: very little on all of fiction TV itself could come remotely close to WW thought provoking depth, would call it relatively mild (probably)).\n\nThank you. I remember watching the first episode at an airport a long time ago. I'll definitely give it another try. 😊\n\nSeconded. This is a fantastic show!\n\nI was never a big fan of superhero shows but I love X-Men so I'll check this one out. Thanks!\n\nWas look for this comment - absolutely amazing show\n\nThis. First season is a bit monster of the week X-Filesish but after about 3/4 of the way through the season it really picks up and is fantastic. One of my favorite shows ever.\n\n+1 Twin Peaks will change your life.\n\nIs It Future? Or Is It Past?\n\nI'm a big fan of GoT. I've heard great things about Sopranos and it has been on my list forever. I definitely need to find sometime to watch it.\n\nThis was a great suggestion.  I feel the same watching Castle Rock as I did with S1 of westworld.  Which was missing in S2 of WW\n\nI don't know that I'd recommend this just yet. Granted I'm one episode behind, but after 5 episodes, its moved pretty slowly and hasn't really gone anywhere. I'd wait for a payoff before recommending it as a complex show on par with Westworld or Lost.\n\nI remember reading about Dark right after it was released by Netflix. I might have it on my watching list actually.  There is only one season so far, right?Thx!\n\nI looove Dark\n\nRamon Djwadi I’m a huge fan of. Dudes a musical genius\n\nThat's an important point about PoI; it definitely gets better (from my point of view) starting at the end of the first season.\n\nBlack mirror\n\nTotally agree with you. Indeed surprising that no one mentioned it (except for you ).\n\nThere really are a lot of parallels; it seems like either Dollhouse was an influence on Westworld, or they have other common influences.\n\nNothin but the rain.\n\nI can forgive the later seasons for how amazing the early ones are, personally.\n\nYeah, I can't wait for the next season.\n\nAmazon prime has the first 2 seasons free, with the 3rd free sometime before next spring.\n\nLegion is less a show about superheroes and more a show that uses superpowers to advance its artistic vision. It's weird and confusing but fun.\n\nI'm pretty late to this but if you watch legion make sure you do it sober and with a clear head. 😂\n\nTwo Words: Part 8.\n\nBig time.\n\nWhat year is this? Is that gum I like going to come back in style?\n\nAbsolutely second The Sopranos! I started watching for the first time just last year. It's one of those shows where it feels like anything can happen and anyone can die...like GoT. It keeps the stakes high and keeps you guessing every episode. You'd like it!\n\nAfter the latest episode I would definitely recommend it. It’s not West World, but I think it has enough going on to keep a viewer interested. I think it has moved at a consistent enough pace without being overwhelming. Also, there are some who would argue that West World moved slowly as well in its first season. And it’s not exactly fair to dismiss a show just because it isn’t on the exact same level as West World or Lost. Give Castle Rock its own props because it definitely has potential. And isn’t the fun of some shows getting to them early enough to see and enjoy the payoff when it finally happens?\n\nDark is mind-blowing!! I rewatched it inmediately after finishing the season. I am on my 5th rewatching and I have still so many unsolved questions. I do recomend Dark (Netflix)\n\nYes, one season. They have already started shooting season two. It’s from Germany. I watched the English dubbed version because I’m not a fan of subtitles, especially on shows with lots going on. Once I got past the dubbing not being perfect, it was fine. Season 1 of Dark and Season 3 of Mr. Robot were my two favorites from the last year or two. And I’m a huge Lost fan.\n\nYeah. Especially the second season, where Dolores is extraordinarily similar to Echo, except, you know...evil\n\nThe first season at least, I’ve always described as Wes Anderson directing a X-Men movie. The second season gets significantly weirder. \nIt’s awesome though.\n\nEx Machina\n\nDark for sure. If you like Westworld but were a bit frustrated with season 2 I suggest diving into Dark with subtitles. It is also hard to follow, but the main issue is with keeping track of which character is which, not with intentional misdirection.\n\nThe Leftovers\n\nMr.  Robot\n\n[deleted]\n\nDark!\n\nperson of interest created by jonathan\n\nBlade Runner.\nBattlestar Galactica.\n\nMemento!\n\nLegion\n\nCan't believe no one's said Maniac yet!\nNetflix original miniseries written and directed by Cary Joji Fukanaga (director of the first season of True Detective) starring Emma Stone and Jonah Hill as two patients in a pharmaceutical drug trial meant to replace therapy once and for all by forcing the subjects to confront their traumas in dreams that play out like alternate realities. \nThese dreams are monitored and regulated by the world's first true AI, who, unbeknownst to the staff and the patients has fallen in love with the director of the program which leads to problem as Stone and Hill's characters continually end up in the same dream realities, unable to tell what's real and what isn't.\nIt reminds me of the films eternal sunshine of the spotless mind and her blended together, it's an absolutely gorgeous show.\nHere's the trailer!\n\n[deleted]\n\nWalk Hard Dewey Cox\n\nBabylon Berlin. The kind of show where you talk about the characters and story in between episodes because it’s so well done and thought out.\n\nBrazil! (Fantastic sci movie from the 80s)\nEx Machina\nThe Leftovers (so so so good) \nBlade Runner\nInto the Void\n\nBlack Mirror\n\nFringe and The OA\n\nThe OA! On Netflix.\n\nHumans on Amazon!!!\n\nDark City (movie)\nBrazil (movie)\nCounterpoint (tv series)\n\nLOST and LEGION\n\nMr. Robot.  It’s breathtakingly beautiful cinematically and boy does it get you thinking. Just like westworld. Questioning reality and all that \nI might like it more than westworld. Jury is still out though as neither show has finished\n\nGhost In The Shell (OG and SAC series)\nDollhouse, incredibly.\n\nLOST\n\nWeird as it sounds but Inception. Def a fave of mine\n\nRussian Doll. Black Mirror. Stranger than Fiction. Altered Carbon.\n\nOrphan Black\n\nit's anime but Ergo Proxy\n\nA Scanner Darkly\nThe Nines\n\nHands down Black Mirror\n\nKilling Eve\n\nWaking life\n\nLegion\n\nHow has no one mentioned Gattaca? One of the best pieces in the science fiction genre.\n\nPenny Dreadful. The show was fantastic, and really dove into the concept of evil and whether it truly comes from a cosmic force, or whether humanity is the impetus for it.\n\nThese are video games, but Persona 5 and Danganronpa V3\n\nManchuria Candidate\n\nAttack on Titan\n\nDidn’t see anyone mention Primer yet. Great low budget film.\n\nThe Matrix\n\nMr. Robot\n\nPretty much anything with themes that make you question the way we perceive the world\nMovies: Arrival, Blade Runner/2049, Captain America: The Winter Soldier, Annihilation, American Psycho, Donnie Darko, Shutter Island, A Clockwork Orange\nShows: Homecoming (mini-series), Mr Robot, Preacher, Handmaid's Tale, Daredevil (s1 and s3 more so than s2), GoT S-4, Black Mirror, not even to go into anime\nShout-out to these games: What Remains of Edith Finch, Firewatch, Everybody's Gone to the Rapture, Mass Effect Trilogy, BioShock collection, Nier: Automata, Metal Gear Solid 1-4,  Yakuza 0-6,\n\nThe OA on Netflix\n\nNeo Genesis Evangelion \nyou can find it on Netflix too since this summer.  \nIt goes far more deeper so brace for it, first 14 episode is generic \"get to know\" phase but from ep14 through  26 and the the movie End of Evangelion is the most intense and deep experience I had so far in any show. I even need to pull my psyche together before I can start watching the newer movies.\n\nMr. Robot.\nIt's final season is coming this winter, it's about an social awkward hacker who attempts to rid the world of their debt.. He's an untrustworthy narrator, so it has a lot of twist and turns and is very mind boggling and beautifully shot\n\nAltered Carbon similar in concept of downloading consciousness\n\nThe Thirteenth Floor\n\nBoth bladerunner’s for sure\n\nNot particularly a show/movie, but the video game Detroit Becomes Human. An absolute masterpiece, so many parallels and similarities that it’s almost scary. I highly recommend watching a full game play of it.\n\nMr. Robot (TV)\nLucky Number Slevin (movie)\nAny Christopher Nolan movie tbh\nCloud Atlas (movie)\n\nDark\n\nTruman Show, and you know damn well I'm right.\n\nThe OA\n\nBlade Runner and Blade Runner 2049\n\nSense8\n\nThe OA, recently cancelled by Netflix (damn you) but it's a pretty interesting premise, and I cannot honestly give you an synopsis because of how WTF the show is. But it's very very well done and visually pleasing and very interesting with some questions and ideas being asked\n\nIf you want a mind bending and thought provoking show watch Dark on Netflix. It's a very underrated show, revolves around time travel, wish more people watched it.\n\nBlack mirror\n\nNetflix’s German show “Dark”. If you hated the “non-linear” aspect of WW S2’s timeline maybe Dark isn’t for you, but if you want a time travel show that will subvert time travel tropes this is for you.\n\nTwin peaks in a more cerebral way\n\nLeftovers\n\nFringe\n\nLost\n\nOnce upon a time in Hollywood\n\nIdentity\nShutter Island\n\nBlack Mirror. Everything becomes super clear towards the end even though you start out confused.\n\nThese mostly time travel related but will get you thinking!. \nDark - Show\nCoherence - Movie\nTriangle - Movie\nMr Robot - Show\nTimecrimes- Movie\nPrimer - Movie\n\nTerrence Malick stuff\n\nThe longest day in chang'an, too much details made my brain explode.\n\nThinking deeply in terms of society and the human condition?\nStargate, all 3 series.\nthinking deeply in terms of the plot and where the storyline is going.\nVikings\n\nOnce Upon A Time. Incredibly twisted storylines and character connections just like WW\n\nShows: Black Mirror, Handmaid’s Tale.\nMovies: Enter The Void, Eternal Sunshine of the Spotless Mind.\n\nPeaky Blinders keeps me on my toes.\n\nUtopia\n\nBlack Mirror for sure!!!\n\nAltered Carbon on Netflix\n\nAltered Carbon\n\nBlack mirror\n\nMaybe not in the same way, but After Life with Ricky Gervais hit something in me that made me, more than think, reflect a lot\n\nBlade Runner / Blade Runner 2049\n\nThe Leftovers; Six Feet Under\n\nMr.robot\n\nNot a TV show or movie, but detroit become human made me think about westworld a lot\n\nLost, deep space 9, The Third Man, Usual Suspects, Matrix, Spirited Away, Princess Mononoke, Rear Window, Making a Murderer, Battlestar Galactica.  \nAnd of course: BLACK MIRROR (Westworld is practically a spiritual spinoff)\n\nPrimer\n\nDon’t know if it’s mentioned but Surrogates was really eyeopening for me.\n\nCheck out American gods on amazon prime or better yet read the books.\n\nI had a 20+ list id typed in on my phone and I accidentally swiped up and closed the app when I went to check my IMDB watched list. 😭\n\nMr robot\n\nfirst 4 seasons of game of thrones\n\nSeason 8 of GoT, JK.\n\nI just watched Altered Carbon and there are definitely some similarities.\n\nJoss Whedon's Dollhouse, it's almost the same but the bodies aren't synthetic.\n\nBlade Runner\n\nDark on Netflix.\n\nThe book series The Remembrance of Earth's Past, starting off  with The Three-Body Problem. Science fiction has seriously never been the same for me.\nOr the book Children of Time and its sequel, Children of Ruin.\n\nThe British show Humans, which unfortunately just ended it's last season.\nIt. Is. Amazing.\nImagine what Westworld's season 4 or 5 will be like after Dolores enters the world and people start copying the robots. The robots are now among us and are tools in our daily life, like the dishwasher or any appliance. That's what Humans is. And without any of the stupid \"wtf? Why would anyone do that?\" things that Westworld season 2 had. And without resorting to gunfights when the writers don't know how else to keep it interesting.\n\nDetroit become human. A ps4 video game, but there are let’s plays of it on Youtube!\n\nA Scanner Darkly.\n\nDark\nAnnihilation\n\npretty much every western i happen across on tv at this point is just another area of westworld.  it helps explain why some of the shooting death scenes are acted so unnaturally.\n\nMR. ROBOT!\n\nMr. Robot\n\nLOGAN'S RUN. I can't believe no one has mentioned this one.\n\nManiac\n\nGitS:SAC and Lain are the obvious ones. \nThe creators of Lain have made the series, more or less, public domain now, which is in keeping with the old hacker ethos. It's an amazing, seminal series that influenced so many people just getting into cyberpunk in the late 90s/early 2000s.\n\nBetter Call Saul!\n\nDark comes to mind. Watch with German audio and English subtitles. The English dubbing is not very good.\n\nDeath note\n\nDark\n\nLOST \nIts super good and complex\n\nDark\n\nWestworld the movie. I haven’t watched it myself so I’m not sure how similar it is\n\nShin Sekai Yori\n\nFleabag\n\nNBC’s Hannibal\n\nI Am Mother, Moon, Altered Carbon\n\nThe OA on Netflix\n\nThe 100. It's more on the teen drama side, but (specially) later seasons show very cool sci fi, and it asks a lot of questions about the ethics of surviving and new technologies.\n\nGhost in the Shell original film (1995 version, not the computer-enhanced 2.0 version)\nThe sequel, Ghost in the Shell 2 Innocence is also good, but different then the first film.\nThen the Ghost in the Shell TV shows and standalone films that take the same characters and tell great stories in alternate universes.\n\nLegion\nSeries finale was last night and it was beautiful.\n\nHow has no one mentioned The Orville yet? Possibly my favorite show on television right now, season 2 was absolutely excellent.\n\nnone\n\nThe Crown. Made me think deeply about how it should be like to be in the family at the center of the world. All the politics and level of bullshit you have to handle just because.\n\nKidding. For a mainstream TV show to address childhood and intergenerational trauma so directly, while remaining funny, nuanced, and artful, is a huge achievement. It's not sci-fi, but many of the themes that attract me to works like Westworld, Arrival, Ex Machina, Annihilation, and Star Trek are present. Origin stories, self vs. community, the link between victimhood and abuse, the struggle to work through/overcome inner darkness, perpetually shifting moral landscapes, the quest for emancipation, innocence and guilt, battling systemic Injustice (vs./while also) assuming responsibility for one's own healing and growth—many good shows and movies touch on these themes, but great ones gently and articulately expose more and more depth and subtlety over time. The Wire was my first experience of that in a TV show. East of Eden was my first experience of it in a book. Anyway, I believe neglected trauma is the driving force behind many of our current socio-economic, political, and racial problems. That's why these stories are important. Westworld and Kidding both deal with the epic legacies of trauma, and I was reeling and in tears after both season one finales.\n\nMovies specifically about what it means to be human vis-a-vis a machine:\nEx Machina.\nA.I.\nBlade Runner and Blade Runner 2040.\nBattlestar Gallactica (the remake).\nTerminator and Terminator 2.\n\nThe Man In the High Castle can be pretty thought provoking, on different ways than WW but still pretty good.\n\nAltered Carbon\n\nLOST\n\nAnnihilation too! No robots though, but same filmmaker\n\nNON SIBI SED PATRIAE [X2]\n\nListen to the German. Read the subtitles. Agreed. You miss out on tone and emotion without that. Great, great show!\n\nThe best thing is it's planned for only 3 seasons. I really hope they wrap it up satisfactory. Would be the first good german show/movie in a while.\n\nCame here exclusively to say this. Season 2 is the best show I've seen this year.\n\nAnother vote for Dark, amazing show.\n\nDark, for sure.  I describe it as so complicated, it makes Westworld look like a Disney cartoon lol.\n\nI just finished season 2 last night! I started season 1 last Thursday and couldn’t stop! Just brilliant TV!\n\nFinally someone else acknowledges this show. So damn good.\n\nAnother vote for Dark. Just finished season 1 today and diving right into season 2.\n\nJust finished that and God damn what a show. Total mindfuck\n\nLoved season one, got weird couple seasons- in, but then the ending blew my mind. Great show for sure!\n\nThe best show that’s ever been on TV and I will not hear otherwise\n\nYesss! I was looking for this comment as soon as I saw this post. It really needs to be higher up. I’ve never been so emotionally and philosophically shaken.\nThat being said, I wasn’t too happy with the ending, from the standpoint that I felt the best part of the show was how it left the mystery intentionally vague. When humans are faced with seemingly unanswerable questions, they inherently become superstitious/religious, which is what was so interesting about the show, seeing logical, modern people have their entire perspective on life completely ripped apart due to uncertainty. And I think by answering the question, even a piece of it, lays a sort of foundation of logic/understanding to the mystery, which in itself undermines the entire premise of the show. But yeah I guess they wanted to give the audience a little closure. \nAlso, sorry for making this sound very r/iamverysmart -esque, but I was trying to sound vague to not give away too much for people who haven’t watched it. Plus it’s hard to explain the emotional/philosophical plot of that show.\n\nHad to scroll down too much to find this ! By far!!\n\nWas going to suggest this too\n\nCan’t believe this wasn’t mentioned earlier. Definitely a level above Westworld (for now) with how deep it can get.\n\nSeason 2 is a tough watch in my opinion, though\n\nI love Mr Robot, but some people find it too personal and don't like the psychology angle... the depression and the loneliness.\n\nYessss! So excited to see how this show ends, season 1 is definitely one of my favorite tv seasons ever\n\n\"Die hard \"\nI got reference\n\nGood list.\n\nNice list. My top picks out of that are Inception, Looper, Dark City ( a masterpiece), Source Code, The Prestige, and Butterfly Effect for fun and What If\n\nAbsolutely after 100%.  I'm obsessed.\n\nPerson of Interest has very similar themes to Westworld (Jonathan Nolan clearly has a deep interest in AI).\n\nJust got into this recently and I spend all my free time watching it\n\nCame here to say this. Can't recommend this show enough.\n\nI like that you're on a first name basis with this dude\n\nBattlestar Galactica on Syfy was a great show\n\nBeets. Bears.\n\nMake sure it's the newer version of Battlestar.\n\nBased on a short story be Jonathan Nolan.\n\nCan’t stress this enough. Such a great movie.\n\nThis is the correct answer\n\nCame here to say this\n\nAs a major life long fan of Pink Floyd last night’s series finale had me in tears!\n\nWith ll due respect and love to Westworld, Legion in my opinion is way better and more fucked up. I fucking love it.\n\nI loved season 1 but wasn't able to get into season 2.\n\nThis show was too much for me\n\nMine too , great book list (but I didn't like Oryx)\n\nAn unsung classic\n\nSuch a good show. So good\n\nBRAZIL! Why haven't I seen that mentioned before? Why havwntni mentioned it. One of the best SF films ever. So dark, so funny, so brilliant. Good call.\n\nA bit different,but definitely Black Mirror\n\nThis but not the current season. The quality is taking a dive imo.\n\nMeh Black Mirror is just a cool tech gone bad. It also is normally a ridiculous stretch. There are some great ones. But overall....meh.\n\nLoved Fringe. Just rewatched it again last spring. Previously watched in FOX, when it first aired. Great show.\n\nThe OA is such an amazing hidden gem.\n\nYess!! Definitely!!\n\nWestworld is one of my favorite shows and I thought the OA was completely nonsensical. Saw both seasons and I would not recommend this show to anyone.\n\nIt's a low rent version of WW\n\nSo much this, and the fact that it isn't higher on this list just shows that too few people have heard about it. It's one of the best written shows I've seen, and doesn't have any of the \"because..... television\" moments that other shows pull (ie final season of Game Of Thrones). It takes the best cues from movies that did it well, and turned it into 3 seasons.\n\nMan, I saw the first season of Humans after watching season 1 of Westworld and thought it was absolute shit in comparison. Seemed like a network-TV, extremely surface-level version of some of Westworld's (broad) themes. Zero subtlety in plot or character, covering well-worn philosophical ground in a shallow way and without adding anything new.\nBut hey, to each their own.\n\nDark City is a gem\n\nBrazil was a such a great movie\n\nYes! Someone else mentioned Brazil! Man, what a classic\n\nWould you like a treatment?\n\nYeah totally. Great characters too, it could be a crazy science fiction show, but it never lost that authentic human core.\n\nI mean if you only account for half the show which is strung along with cliff hangers. \n\"The island has moved\"\n\"Polar bear\"\n\"Black smoke mang\"\n\nyea just don’t watch the last season tho.\n\nHonestly it would probably be weirder if you didn't start having an existential crisis after watching Inception\n\nI watch it over and over again and enjoy it every time.\n\nGreat recommendation. Some interesting ideas in Ergo Proxy, I think I need to re-watch, its been about 10 years.\n\nSeason 2 was a let down I thought. It seems to repeat itself and not really go anywhere till the end.\n\nBeautiful movie!\n\nUgh such a great show with SO much potential! Was so bummed that they rushed an “ending” such as it got\n\nFinally got around to P5 and really enjoying it thus far though I see where it could end up a bit repetitive/tedious.. but such is JRPG life. Nearing the end of Madarame's palace. Living up to the hype thus far anyway. I just hope I am using my days wisely outside of palaces...\nBeen said elsewhere in the thread but as far as shows, DarK is pretty awesome though definitely a lot to keep up with.\n\nManchurian, and yes  absolutely\n\nPrimer made my brain hurt. But in a good way.\n\nPlus Rami is absolutely fantastic\n\nYes!!! Agreed!!\n\nDo I need to watch the original before watching 2049? I've read the book if that would help.\n\nI’ve never seen philosophy so seamlessly written into a narrative\n\nAll caps, brotha.  Always all caps.\n\nSee you in another life brotha.\n\nUpvote for Dark. Brilliant brilliant show.\n\nNever thought I'd see Westworld and Once Upon A Time mentioned in the same thread\n\nHighly suggest checking out this video, Annihilation and Decoding Metaphor by Folding Ideas which unpacks the thematic content that Annihilation the film is largely built upon, at least I choose to subscribe to this interpretation anyway. I was left feeling kind of empty at the end of Annihilation, thinking \"oh I suppose the shimmer is just within Lena and her husband now\" but the video helped me understand how the film as a whole has much more nuance and complexity, some of it explicit and other parts implicit. And as the video makes fun of at the beginning, many of the interpretations on YouTube largely focus on the shimmer aspect but completely miss the metaphorical and thematic premise.\n\nAnnihilation was amazing!! Sadly not many people watched it.\nI've seen it around 5x, that last sounds track doing the climax.....made me climax...\n\nthis is one of my fav movies of all time!\n\nIf you haven’t had the chance, read the book. It’s incredible and terrifying. The entire trilogy, in fact.\n\n3rd here for Dark it is my #1 show. And also agree German audio with subs.\n\nI recommend this technique for Kung Fu Hustle.\n\nSubtitles and native language is ALWAYS better than dubbed movies and tv IMO\n\nOnly 3 seasons? While I like this, I also don't. Me and my gf binged s1 and s2 this last weekend and I was worried they would stretch it to the point it gets bored but if it's only 3 seasons I don't fear that anymore. It's just sad to lose such a amazing show but is for the best.\n\nThey have a great official website that explains a lot https://dark.netflix.io (with spoilers for S1!) and r/dark has a lot of useful diagrams and interesting theories.\n\nhttps://i.imgur.com/uu9pmDP.gif\n\nHave you been living in a cave without internet?\nIf yes, I'd recommend to check out this show called Black mirror, later seasons are not as good as the first ones, but it is a good watch.\n\nOF course I beleive you. You're here, aren't you?\n\nMost people say season 2 was the best but season 1 was near perfect for me! It was one of the most powerful shows I have ever watched and the soundtrack is fucking incredible!\n\nYou will from me that show sucks\n\nsound very r/iamverysmart \n\nnot at all, your explanation is very precise and articulated well. I think you summed it up perfectly\n\nFrom the beginning, it was never about the question or the answer, only the response. That show is so so damn good.\n\nThink back to the finale though. Did they really answer any questions definitively? They didn't show anything on screen, everything was relayed by Nora as a story. Who's to say she wasn't lying?\n\nIs the upcoming season(4th) the final season?\n\nAgree totally on first half. Second half of Season 2 was great, imo. You dislike the whole season?\n\nI wish I would’ve kept watching but season 2 was a drag! Hope I’ll pick it up again soon.\n\nJust finished S2E7 last night and was blown away. This is my second time trying to get through this season and it's much better on second watch imo.\n\nImo, season 2 had one of the best episodes I've ever seen on TV. Episode 6\n\nI guessed everyone here knows who he is lmao\n\nCaprica\n\nIdentity theft is not a joke, OpusMagma!\n\nr/unexpectedoffice\n\nAmen.\n\nWould you recommend the short story as well?\n\n“We’re all in this together!”\n\nAlso black mirror\n\nIt’s really starting to take the “What if phones, but too much” meme to heart.\n\nThe quality is taking a dive imo.\n\nmaybe even a Nosedive\n-\n-\n-\n-\n-\ni'll get my coat\n\nI watched BM after so much hype and it was the most depressing shit I ever saw.\nI hated each successive episode more than the preceding one. I just don’t get its appeal. Take the Twilight Zone and make it soulless and humorless & bam you get Mirror IMHO.\n\nSame here, almost better the second time round\n\nToo bad they have canceled the third season.\nHoping to get at least a movie, like Sense8 managed to get.\n\nSadly season 3 is cancelled\n\nCanceled. boom in your face.. I just made myself sad\n\nthe OA is strange. it’s not for everyone\n\nWestworld is one of my favorite shows too, and I absolutely loved both seasons of The OA and would recommend it to anyone willing to keep an open mind 🤷\n\nOA is crap. Well done crap but crap.\n\nBut with a far better plot than Westworld season 2 could dream of. And season 3 of Humans wasn't so low rent.\n\nIt needs to be on the \"films you need to see that haven't been mentioned a thousand times\" list.\n\nHa, that's how I felt when I saw it mentioned.\n\nDid I fall asleep?\n\nThe show was so much more than that. It was about answering the fundamental questions about what makes us human. The rest was window dressing. The Leftovers did a better job in execution though\n\nI'm still in mine.\n\nI refuse to accept that ending. It was so forced and left so many loose ends.\n\nThe problem with P5 (and other Persona games, from what I've been told - only really played P5) is that it's nigh-impossible to do everything first time around. In New Game+, you start with all your attributes as they were at the end of your first playthrough, so you can access certain confidant paths quicker than you did before. Plus you'll have a better understanding of the story progression; some confidant paths and side events don't progress further until after you've reached certain dates, and others become inaccessible if you leave them for too long, so if you're not aware of that you can waste a lot of time on stuff you can't progress and miss some stuff if you leave it too long.\nMy recommendation is have fun and do what you want on your first playthrough; don't stress too much about optimising your daily plans. If you decide you want to play through again, do it on New Game + so you'll have access to content locked behind attribute advancement faster, and know the story beats so you can plan your time better.\n\nWhoops! Thx\n\nFor sure! I can't wait for the finale!!\n\nDo Androids Dream of Electric Sheep? and Blade Runner are both fantastic, but reading the book isn't really an alternative to watching the movie. The movie was more inspired by the concepts of the book as opposed to a cinematic retelling of it.\nI think you also need to watch Blade Runner to really enjoy and understand 2049.\n\nWe have to go back!\nBut also Flashforward and 4400\n\nI love that video!!! I totally agree with you and Dan's interpretation, it really helped me make sense of the movie and appreciate it even more. His message was spot-on since I realised that I myself was trying to interpret movies very literally (hence why I couldn't understand Annihilation when I first saw it). His point about anti-intellectualism rooted in ambiguity also stuck with me.\n\nRead the full trilogy, the story is pretty fucking wild... The movie is pretty and captures the atmosphere but it ignores most of the story as only one book was available when the movie was written.\nSeriously, the books were the most original science fiction I had read since three body problem.\n\nIt inspired me to read the books, which are also amazing for very different reasons. But I love the film a ton\n\nI feel like you'd have to watch the show a couple of times to truly appreciate it if you're going with a foreign language audio. Can be difficult to read and watch thoroughly. Would you agree? I am watching westworld a 3rd time so I don't mind rewatching great art.\n\nSeason 1 is my favorite as well. :) It’s such an underrated show. \nr/theleftovers\n\nThanks!\n\nYeah, I guess she could be lying, but if she wasn’t, which I don’t see a reason why she would, then there are fundamental laws to what happened that eventually people could figure out and solve. \nThe only major supporter of the idea that she might be lying is the fact that, however many years later it was in the finale, what happened (what could happen) to Nora and the others still hadn’t gone public. That organization was on the run in the first place though, and it might’ve just gotten shut down. \nIdk, either it’s some supernatural event or some random currently undiscovered scientific phenomena, so either way it’s something to think about. I just enjoyed the forced philosophical/theological dilemma the show made in earlier seasons.\n\nYes. The creator always had a specific ending in mind and he's doing it.\n\nYes\n\nHonestly, I only watched it on its original release and never rewatched it. I do remember once the dark army got more involved it got better. Every scene with Angela made me cringe tho haha\n\nDid you see the ending of s2...\n\nSame bc I’ve heard season 3 is very good and more like season 1. With season 4 being the final season, I will likely pick it back up again eventually\n\nNice. Maybe I’ll check it out sooner rather than later\n\nWhich one is that? I can't remember.\n\nI know, it's just kind of adorable\n\nIt’s too bad they canceled it too soon. They could have definitely done another season.\n\nWas awful. Really dreadful. Jesus.\nItalian Gangster Planet? Lol\n\nMillions of families suffer every year!\n\nYeah.  It’s a little different than the movie but it conveys the same sense of discontinuity as the movie but in a different medium.\nThe joy of a short story is that if you don’t like it, it’ll be over soon anyway.\n\nWhat about Black Mirror?\n\ncan’t believe in the fifth season they still doing “phones are bad” like god damn. it’s been a gradual thing though, the fourth season only really had a couple great episodes but nobody wanted to admit it at the time\n\nYeah...I really, really wanted to like this season, but I actually really thought it sucked.\n\nFor now ... #savetheoa\n\nYeah it took them 3 years to come out with a second season.  I have no doubt they will eventually do a third.  Just wait for Netflix to hit a lull.  They’ll start looking into their canceled shows then boom! OA season 3.\n\nNaw it just went IRL. #SaveTheOA\n\nIt went IRL it’s not cancelled.\n\nI knowww I am very upset\n\n\"For a little while.\"\nAlright that settles it. Going to refresh my memory on season two so I can finally read the Epitaphs graphic novel this week.\n\nI mean I agree that existential question was asked, but which decade are you asking it? In hippie 1950s or present day Island?\nWhat do the numbers mean?\nIt’s an awful show in full context. I’ll admit I was hooked.\n\nIt was about answering the fundamental questions about what makes us human. \n\nThat's what every show thinks it's about.\n\nRight. They knew it was canceled so they tried to give us SOMETHING but....\n\nA show that has the awareness to end before it gets bad? What an incredible concept!!\n\nI'll see you in the alternative reality, awaiting you brotha\n\nAbsolutely, the idea of anti-intellectualism is rampant in entertainment which is why shows like Westworld and films like Annihilation are not as common as we'd like, many writers and film-makers try to impart deeper meaning within their work but it can be easily glossed over for a literal interpretation. \nLike Stories Of Old is another fantastic channel that does amazing film essays and deconstructs films like Inception, Interstellar, Arrival, Lord of The Rings, Signs and many others, even Spider-Man 3 (the one with Toby Maguire) from a thematic viewpoint, whether that be questions of self-identity and grandiosity or themes of archetypal nature. It is literally my favourite channel on YouTube.\n\nI just finished the first is the southern reach trilogy. It was pretty good! Can't wait to start the second.\n\nI read fairly fast so wasnt really an issue, also I find it forces you to pay full attention.\n\nAudio dubbing is a great alternative. It’s not as cheesy as it used to be back in the day. Very talented voice actors.\nJust depends on your “learning style” and the type of show. I usually use subtitles but for this particular show the dubbing was beneficial for me.\n\nWasn't it going to have 5 seasons?\n\nDid you see the ending of season 2? Everything makes sense and you realize that whole season set you up for that one last episode/scene\n\nI didn’t like I said the first like 5 episodes just killed me to watch.\n\nSeason 2 walked so that season 3 could run.\n\nThe one where spoiler spoiler spoiler\nThe sitcom episode. Where the intro is changed and it's a very different tone. The meaning behind it was insane and well executed imo\n\nMICHAEL!\n\nWell, it is ok, but I prefer Black Mirror.\n\n#TheOAisReal\n\nWe're trending again, and just got to 50k signatures!",
  "They should have at least had the werewolf vs big bad fight that they’d been foreshadowing that resulted in the big bad not getting away scot-free.\n\nMind boggling.. a showrunner who wrote out the show in advance so he can lay the groundwork to end a show in a decent time!? What??\n\nThanks for the recommendation! I'll check it out!\n\n[deleted]\n\nHis original plan was for 4-5 seasons but the ending he always had in mind was the same. From Sam's AMA about number of seasons.\nAnd about the ending.\n\nYes I remember what happened somewhat but don’t really remember how it related back to everything and tied it together\n\nIt’s pretty much the purpose. The payoff at the end makes EVERYTHING you watched make sense. I felt the same way as you until I finished it. When I went back to watch it the second time it was probably the best season of tv I’ve ever watched.\n\nMICHAEL!\n\nIt would have been more satisfying no doubt about it.\nI’m guessing there was zero budget or time for that between finding out it’s fate and final editing/submission...? Which reminds me I should go in search of some after the fact interviews to see if anything was ever said. I read the ones that were available at the time, but sometimes they are more willing to talk smack / hard truths after a passage of time has elapsed....\n\nThe thing is I am not too lazy to read. People in general are NOT too lazy. \nThey happen to have a cinematic viewing style that differs from yours. Some people want to concentrate on visual aspects such as the actors faces, costume design,  cinematic composition, and mise en scène, whatever it may be...\nOther than that their eyesight and eyestrain most likely differs from yours. \nThe pace, intricate plot lines, and LIGHTING of this particular show. (It has very dimly lit scenes if you hadn’t noticed.) all work to make it a perfect fit for audio dubbing for certain audiences. \nReading subtitles doesn’t win points in my book.\n\nThanks\n\nWow yeah I know I need to pick it back up since I loved season 1.\n\nSure thing. I feel like Westworld was also on a similar initial timeframe in the 4-5 season range from the beginning according to Jonathan and Lisa. I much prefer stories that have an ending in mind than just an endless run into mediocrity for the sake of money and popularity. Simply too much great TV to waste time going nowhere with shows that have no intention of ending.\n\nMaybe devs\n\nDark is pleasingly complex\n\nNot out yet but Ridley Scott’s Raised by Wolves on HBO Max looks super promising — androids x humans mingling yet again\n\nDifferent stories but still make you think:\nMr Robot\nThe OA\nThe Expanse\nBattlestar Galactica\n\n[deleted]\n\nI will add that Dollhouse is another great series, with only two seasons, so it's quick to binge-watch. I believe it's on Hulu now.\n\nYou should also check out the UK show \"Humans\".\n\nBattlestar Galactica (2003): freaky existential war between humans and robots, all searching for purpose.\nLOST: outcasts exorcise their demons in a mind-bending, millennia-spanning, nonlinear epic adventure.\nMr. Robot: incredibly timely show about societal decay and revolution in the modern cyberpunk age.\nDollhouse: a secret facility houses a bunch of mind-wiped John and Jane Does, or \"dolls\", and gives them new identities -- sometimes to perform certain tasks but mostly to cater to rich elites -- with one particular female doll becoming self-aware. \nThese are the shows that Westworld most reminds me of; Dollhouse especially is very similar. Looking forward to checking out Dark sometime.\n\nOr black spot\n\nI just finished snowpiercer and LOVED it. It's different than the movie for sure, and Bong Joon Ho (Parasite) worked on both the movie and the current show. So good.\nI also really enjoyed The Magicians--smart writing, always kept me surprised, never failed to follow through on upping the ante or having real consequences for the actions of every character. It's also done already, so you can binge it!\n\nWW S01: Deadwood + movie\nWW S02: The Leftovers\nWW S03: Continuum and Hard Sun\n\nNever seen dark. What did you like about it\n\nI started watching Westworld after somebody suggested it when I was looking for something after watching altered carbon. So if you haven't seen it, I would really suggest watching altered carbon\n\nBlack Mirror ?\n\nGhost in the Shell franchise is fairly close to Westworld, except that they deal much, much more with the singularity and have less of a focus on AI.\n\nHave a look at 'Brave new world ' .\nhttps://www.youtube.com/watch?v=rNCUBPkkg5w\n\nI don’t think many shows like Westworld exist tbch.  Rather unique, what pulled me in\n\nMr. Robot, Dark, The Leftovers\n\nI feel like Mr Robot has a lot of the same themes going on in it's own unique way. There's the critique of consumerism, the anger toward society, the threat of intellect control/manipulation, the whole aspect of seeing things that aren't there, strong dialogue and cast performances, and honestly they both have pretty solid writing with interesting mind fuck moments and creative directing.\nI remember before Westworld there was a show called Humans on AMC, I didn't get far for reasons unrelated to the show and haven't heard much about it since but it had three seasons and an interest in exploring the same theme of fidelity and memories. I'd say check that out if possible. I actually just found out I can watch it on Prime so I'm going to watch it now. Glad I saw this post, thanks. Lol.\n\nHumans, a UK show, should still be on Amazon Prime. It doesn't have the budget of Westworld, and it's a very different setting (domestic, rather than a theme park), but it avoids the dumb things Westworld did in seasons 2 and 3.  If anything, it's ahead of Westworld. \nImagine Westworld but with a lot more hosts, which you can buy and keep.\n\nTerminator: The Sarah Connor Chronicles\n\nAltered Carbon, on Netflix\n\nSharp Objects on HBO.\n\nAlthough a completely different show. Succession is my new favourite show. It has great writing, characters and actors. I highly recommend it!\n\nThe Office.\n\nI think dark is better than devs\n\nRidley Scott created what is arguably the greatest take on this theme already, I didn't know about 'Wolves but I will definitely be checking it out.\n\nmy FAVORITE show! going off the similar themes thing, there's some easter eggs I noticed- for example, at the end when Root says \"is this now?\" sounded awfully familiar\n\nThat was an awesome show, but I also had a massive crush on Eliza for a while so that opinion comes with extreme bias.\n\nGreat show!\n\nSeconding Battlestar Galactica. One of my all time favourites.\n\nonly first season , second is utter crap.\n\nGood miniseries but literally not comparable or close to Westworld\n\nOP: “Looking for a show like westworld”\nResponse: “Well let me tell you about this dark comedy about a modern day media mogul and his family.”\nLol wut?\n\nGreat show, but not like Westworld at all. Downvoted.\n\nAgreed. Way better ending\n\nIt’s different from DEVS, Dark is more like 12 monkeys tv show\n\nPerson of Interest also from JJ Abrams & Jonathan Nolan with a score by Ramin Djawadi.\n\nThe best bet for you is all the sci fi and dystopian books which Westworld is inspired from.\n\nSee if this helps in any way.\n\nI’ll tell you an obscure and lessor known film that I actually think I was really good, it’s called “The Signal”\nUnknown cast except for Lawrence Fishburne \nProbably on Netflix\n\nUpload on Prime. Different than WW, but very good. Dark humor.\n\nAltered Carbon on Netflix is pretty good\n\nDark on Netflix is a really great show, also if you haven’t seen Better Call Saul I recommonded giving it a try, season 5 was absolutely amazing.\n\nDollhouse is similar in theme to Westworld.\nLost has good mystery and character development.\nMr robot is smart and contemplative with strong twists like Westworld.\nBlack mirror and the new twilight zone are great anthology sci fi.\n\nthe leftovers\n\nStarted reading and immediately thought of Peaky Blinders, so GMTA. One of the parallels with WW is how they've adapted 'modern' music to be a relevant soundtrack to a period show. And as it's been written start to finish by the same guy, it's uniformly excellent.\n\nYo this is a super insanely late response but after months I finally started watching persons of interest. Just started the second season. Season 1 finale is the best plot choreography I’ve ever seen. This show is absolutely amazing man thanks for the recommendation\n\nI haven’t seen season 5 yet!! Thanks for reminder, that show is killer I gotta watch that.\n\nBCD is one of my favorite shows of all time but not so show it’ll scratch the WW itch in terms  of  genre\n\nLol I know this reply is long after the fact but was going through my posts and found it haha. Dude Peaky Blinders is literally tied with WW for my favoritest of favorite shows ever. So damn amazing. Made me a gigantic fan of cillian murphy as well man. Absolutely genius show. Season 5 is just as good as all the rest of you for some reason haven’t seen it yet.\n\nLol because he/she mentioned enjoying BB and peaky blinders. I can’t think of any shows that can compare to WW, especially season 1.\n\nMr Robot has a lot of similar elements you may enjoy\n\nThe Leftovers\n\nLost is pretty good. From a non-genre standpoint, think The Wire would also qualify.\n\nFringe.\n\nThe Wire is very heady in politics, policing, poverty, education and journalism.  The Wire changed my perspective on these 5 topics.\nMost tv shows lose 'it' because they put popularity and ratings ahead of writing and plot.  \nThe first season of the Walking Dead was great but each season after they lose more originality. \nGoT in the 3 to 4 seasons but afterwards it plummets into a cliche popularity contest driven by the viewer expectations.  The books, A Song of Ice and Fire is much better put together but some others find the latter books a letdown.  \nBattlestar Galactica is very trippy and cerebral if you make it through all seasons.  It touches on similar themes of free will, predestination w Artificial intelligence. The downside is that at times the show lacks continuity and some episodes are stand alone and don't drive an arching plot.\nThe anime movie Perfect Blue is trippy and cerebral af. As is the anime series >Serial Experiments Lain   im not a big fan of anime either, most are shit like most of live action tv.\nI personally don't want a show that only wants to entertain me for an hour.  I want interconnection and continuity. If a show has more than 13 or so episodes per season its shit. The exception for me are 30 minute comedies such as the Office, Parks & recreation and 30 Rock. \nThe most cerebral stuff ivr encountered was in books such as A Scanner Darkly and the Dune series.\nEdited grammar\n\nHumans (the C4 channel UK show):  The story is set in a parallel universe where technology is highly advanced and lifelike humanoids called Synths  (like Hosts) are the must-have machines for any household.  Really well made and acted, I actually like it a bit more than WW.  \nDark (Netflix - please watch with subs the dub is painful) - similar disjointed timeline storytelling, taken to the next level.\n\nI've always said Westworld has the \"wtf is going on\" factor of lost, but done better. So yeah lost is a fun one. Great show, but a lot of people didn't like the ending. Worth the watch imo.\n\nTwin Peaks, but please view it in the correct order (S1, S2, Fire Walk With Me, Missing Pieces (arguably optional on first pass), and The Return), and resist the temptation to spoil yourself by researching it online during your first trip through.\nThere are a number of books as well, Laura's diary being the most important, in my opinion. You'll have questions after, and there are plenty of people who are happy to try to answer them, myself included. 🙂\nEdited to add this link: Twin Peaks: The Return is the only television show to have ever been included in MoMA's film series. \nhttps://www.moma.org/calendar/events/3861\n\nTrue Detective (S1 at least) is pretty great. \nAltered Carbon is some more neat sci-fi that deals with a world where people are (more or less) immortal due to their minds being stored in fancy USBs at the base of their skulls. The main char is a dude who gets re-uploaded into a new body like 200 years after his last death to help solve a murder. The victim is still there of course and is  helping with the investigation. Also apparently they just got a second season announced like yesterday.\n\nMr. Robot techwise yes, somewhat True Detective S1 for quoting pessimistic philosophers but really... theres not enough celebral live-action shows. Trust me I searched too.\nThe only thing close to actually being cerebreal and why I like Westworld is because of its cyberpunk similarities to animes like GITS-Stand Alone Complex, Ergo Proxy, Lain or Texhnolyze. Most of life-action shows are afraid of being cerebreal.\n\nCounterpart, on Starz. That's a little gem of sci-fi spy game, starring J.K. Simmons. It rises some cool questions about what makes us who we are, and whether there could be a better version of ourselves in a parallel world.\n\nJust re-watched Person Of Interest, another Jonathan Nolan including JJ Abrams as Exec Prod and Music by Ramin Djawadi. The show is about artificial super intelligence.\n\nI LOVE Legion, This is Us and if feel too happy Black Mirror.\n\nDark\n\nI cannot praise Black Mirror and This Is Us enough\n\nGame of Thrones\n\n\"Homicide: Life on the Streets\" did a fantastic job of twisting your brain in intense ways.\n\nTwin Peaks and Black Mirror\n\nThe Expanse\n\nBSG for sure, if you look behind the space battle sci-fi (in case you do not like that part - I do so it’s a perfect package for me)\n\nAlso agree about BSG.\n\nI can attest to Dark with subs. Such a great show. Very worth the watch everyone.\n\nLost didn't end. I'm still waiting for season  6.\n\nAltered Carbon is awesome! Watched season 1 and just started reading the book. Can’t wait for season 2.\nTrue Detective season 1 is the best!\n\nFuck Starz for canceling that show.\n\nTHANK YOU!\nIm disappointed that u are the only one to mention legion so far. Its such a great show.\n\nI've heard great things about The Expanse, not sure why it's being down-voted.\n\nYeah. Just recently i had the idea for a Call of Cthulhu RPG campaign inspired by a cross of True Detective and Stranger Things. The players would be members of the neighborhood watch who start looking into strange happenings in town.\n\nDARK. Can’t recommend enough\n\nYou gotta watch The Expanse. It’s top 5 show for me, especially if you appreciate small details that writers put in there for big reasons. They literally had astrophysicists in the writing room with them to get little details correct. It’s a must watch, on Amazon I believe.\n\nI'm just gonna throw this in there, and this is going to sound very strange, at first. Watch The Good Place. It's mediocre to very good comedy for the first season. And then it takes a very hard turn into Westworld territory. Not sci-fi. Just thematically. You might appreciate the show on its own, but you'll especially like it if you like Westworld.\n\nSince you mentioned Prime Video, there is a sci-fi show called Tales From The Loop. Every episode sort of tells a story about certain characters, but they're all connected and live in the same place and interact with each other. It has all the emotions and sadness and depth of stories and the amazing soundtrack and cinmatography and the gravitas of Jonathan Pryce (aka. High Sparrow from GOT), and of course ROBOTS! I really liked it, you should give it a shot if you're into that kind of shows!\n\nAnother fantastic show is The Leftovers if you haven’t seen it already. It’s the sort of show I wish all tv was like.\n\nThe 3 season run of HANNIBAL was a masterwork. It's available on Netflix. I can't overstate how ridiculously good it is.\n\nWatch Utopia on Amazon. Not the US version, though. The UK version from 2013 is amazing.\n\nAttack on Titan is an extremely deep anime that is set in a world where the characters fight for freedom (much like the hosts). I’m not typically into animes, but this one grabbed my attention immediately. Many people consider it to be Japan and anime’s Game of Thrones. I couldn’t recommend it enough, especially since season 4 ( the final season) premieres on Sunday, and if it sticks close to the source material (which it has done a very good job of doing already) it’s on track to be the greatest season of the show by far, and Season 3 had 4 episodes that received a 9.9/10 rating on IMDB, three of them consecutively. After this season, it will definitely break the internet and I wouldn’t be shocked if it was hailed as one of the best (if not the best) anime of all time.\n\nWestworld was so good it ruined seasons 2 and 3 for me.\n\nOh lawd that’s exactly how I feel. I felt the same way when I finished Breaking Bad years ago and now I feel it again but worse. Ironically I’ve been re-watching Breaking Bad for the past few months and at a point even that felt a little boring in comparison. I hope I can feel again...\n\nFor recent shows, I highly recommend Mr. Robot and The Man in the High Castle. They are stellar, thoughtful, and relentlessly provocative shows, like Westworld. Pretty sure both are available on Amazon Prime. TMITHC gets a little weak in its last season, but Mr. Robot is damn near perfect.\n\nAs two other people suggested, Dark and Attack on Titan are two series you might like considering they share similarities in terms of narrative methods, foreshadowing, and moral dilemmas.\nDark is on Netflix, completed, with 3 seasons (26 episodes). I suggest paying as much if not more attention as this series progresses like I assumed you did for WW. Complex is a massive understatement with how the series challenges your attention.\nAttack on Titan is having its 4th and final season coming up, which should be its best season if it does the source material justice. It's an anime, however, so idk if that'll make or break your interest. 62 episodes so far across 3 seasons, however each episode is 2-3x shorter than WW/Dark's so time invested should actually be the shortest.\nBoth series reward consumers who pay attention in the same manner that WW does.\n\nSame here\n\nHbo has other amazing originals, the wire, sopranos, true detective etc\n\nThe Leftovers isn't anything like Westworld thematically or in setting, but it's in my top 3 along with Westworld for \"best shows I've ever seen.\"\nMy other top 3 is Angel though so maybe I'm not to be trusted.\n\nWatch Mr Robot. \nHint: It's not about robots.\n\nDidn't ruin TV for me, but every time I fire up Red Dead Redemption 2 I get sad that it isn't anything like WestWorld.\n\nFargo, at least the first 3 seasons, were great.  Season 3 of westworld I'm not liking, especially Jessie Pinkman's character.  I feel like they didn't have a clear or clever plotline and were making things up for the last season...\n\nGo watch Person of Interest. Its basically a prequel to westworld (once you get past the procedural nature of season 1)\n\nNeon Genesis Evangelion if you want a kind of similar story in that your left in the dark for most of it and it's kind of a mindfuck to the point that no one really knows what it was about still. LOST if you have time. Someone else mentioned The Good Place and if I could reset my brain and watch that again I would love to. Similar themes to Westworld but much more hopeful.\n\nI can see how you could say that about season 1\n​\nI cannot see how anyone would say that about season 2 or especially the horrendous season 3\n\nBacking up this suggestion. It's fucking incredible. Front to back, everything is carefully weaved to make a mindfucking masterpiece.\n\nAmazing show!\n\nI felt the exact same way as OP. Started Expanse like a month ago after hearing so much good stuff about it. Idk why I’m having some trouble really getting into it, I’m only 5 episodes in. Hope it gets better, heard S2 onwards is much better.\n\nYup\n\nMy friend actually just recommended that\n\nIt's one of the best shows out there right now. \nIf you liked Westworld you'll love The Expanse.\n\nThe Good Place is Top 5, based Mike Schur. Easy to get through too and who doesn't love Ted Danson X Kirsten Bell as 1 & 2 on the call sheet. Rest of the cast is amazing too. Definitely a show that is elevated by both phenomenal actors and great writing. It helps they can handwave everything with straight up magic so you don't get some of the crazier complaints that can come with TV shows.\n\nTales From the Loop deserved a second season. It was very thought provoking !\n\nAnd watchmen, which has only one season 😔. Last two episodes were a bit of a let down but it's absolutely worth the watch. Leftovers, though... I consider a masterpiece. It's required viewing at least once a year along with mad men.\n\nAttack on Titan is that rare series that truly and I mean truly gets better the further you are into the story. Assuming S4 does its source material justice, it's truly gonna be a near-perfect series to watch the whole way through. Very ingenious and daring. Unless someone just can't handle the anime style, any non-anime fan who simply loves intricately crafted storytelling should be able to appreciate its themes and narratives.\n\nI think they were all good in their own way. Overall, I think it’s just world building within the course of the three seasons—even if season 2 and 3 wasn’t as good as one, I think they’re better than most shows\n\nthe ending was great!\n\nI’m a huge astrophysics, philosophy, and AI geek so there are very small details in the expanse that really make the show. For example in episode two when he pores the liquid into the glass they put the coriolis effect in the way the liquid pored. This is HUGE because it is so fucking accurate for how that liquid would have pored in that situation in space. And there are plenty of other little things that you gotta be able to notice to really see how well done the show it.\n\nI know! I loved every bit of it! I'm not sure if they've officially cancelled it yet or not, but I hope it gets renewed at some point. Jonathan Pryce made the whole thing more special!\n\nYou don't like the fact that it's squids all the way down? Ozymandias is the true hero of both stories.\n\nit's NGE for me dawg\n\nSeason 3 was awesome, bit just... Felt... Like spaghetti writing. That's the only way I can explain it. It was like twist after twist after twist. Season 1 was just so laser focused, organized, and perfectly crafted. That said, can't wait for season 4."
]